### Deployment Results :x:



 **Razzmatazzz** your **branch** deployment of `svg-cors` failed to deploy to the **production** environment



<details><summary>Show Results</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # cloudflare_record.socket has been deleted
  - resource "cloudflare_record" "socket" {
      - allow_overwrite = false -> null
      - created_on      = "2024-08-22T11:42:13.8937Z" -> null
      - hostname        = "socket.tarkov.dev" -> null
      - id              = "5fe2cfccd163bec91078f7c40ebd5fb2" -> null
      - metadata        = {} -> null
      - modified_on     = "2026-02-20T23:21:27.669622Z" -> null
      - name            = "socket" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "sxzwu785.up.railway.app" -> null
      - zone_id         = "a17204c79af55fcf05e4975f66e2490e" -> null

      - timeouts {}
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.socket will be created
  + resource "cloudflare_record" "socket" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "socket"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "zendo4jt.up.railway.app"
      + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
    }

  # cloudflare_zone_settings_override.tarkov_dev will be updated in-place
  ~ resource "cloudflare_zone_settings_override" "tarkov_dev" {
        id                       = "a17204c79af55fcf05e4975f66e2490e"
        # (6 unchanged attributes hidden)

      ~ settings {
            # (51 unchanged attributes hidden)

          ~ minify {
              ~ css  = "off" -> "on"
              ~ html = "off" -> "on"
              ~ js   = "off" -> "on"
            }

            # (2 unchanged blocks hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
cloudflare_record.socket: Creating...
cloudflare_zone_settings_override.tarkov_dev: Modifying... [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_zone_settings_override.tarkov_dev: Modifications complete after 7s [id=a17204c79af55fcf05e4975f66e2490e]
cloudflare_record.socket: Still creating... [10s elapsed]
cloudflare_record.socket: Still creating... [20s elapsed]
cloudflare_record.socket: Still creating... [30s elapsed]

Error: expected DNS record to not already be present but already exists

  with cloudflare_record.socket,
  on dns.tf line 64, in resource "cloudflare_record" "socket":
  64: resource "cloudflare_record" "socket" {

::error::Terraform exited with code 1.

```

</details>
